coocox/Mplib/Toshaba/TMPM37x/TMPM376/cmsis_lib/lib/cmsis_boot/startup/coide/startup_coide.c
};

//*****************************************************************************
//
//! \brief This is the code that gets called when the processor first
//! starts execution following a reset event.
//!
//! \param None.
//!
//! Only the absolutely necessary set is performed, after which the
//! application supplied main() routine is called.
//!
//! \return None.
//
//*****************************************************************************
void Default_ResetHandler(void)
{
    //
    // Initialize data and bss
    //
    unsigned long *pulSrc, *pulDest;

    //
    // Copy the data segment initializers from flash to SRAM
    //
    pulSrc = &_sidata;

    for(pulDest = &_sdata; pulDest < &_edata; )
    {
        *(pulDest++) = *(pulSrc++);
    }

    //
    // Zero fill the bss segment.
    //
    for(pulDest = &_sbss; pulDest < &_ebss; )
    {
        *(pulDest++) = 0;
    }

    //
    // Call the application's entry point.
    //
    SystemInit();
    main();
}

//*****************************************************************************
//
// Provide weak aliases for each Exception handler to the DefaultIntHandler.
// As they are weak aliases, any function with the same name will override
// this definition.
//
//*****************************************************************************

#pragma weak ResetHandler         = Default_ResetHandler
#pragma weak NMIIntHandler        = DefaultIntHandler
#pragma weak HardFaultIntHandler  = DefaultIntHandler
#pragma weak MemManageIntHandler  = DefaultIntHandler
#pragma weak BusFaultIntHandler   = DefaultIntHandler
#pragma weak UsageFaultIntHandler = DefaultIntHandler
#pragma weak SVCIntHandler        = DefaultIntHandler
#pragma weak DebugMonIntHandler   = DefaultIntHandler
#pragma weak PendSVIntHandler     = DefaultIntHandler
#pragma weak SysTickIntHandler    = DefaultIntHandler

// External Interrupts
#pragma weak INT0_IRQHandler      = DefaultIntHandler // 0:  Interrupt Pin (PH0/AINA0/96pin or 98pin)
#pragma weak INT1_IRQHandler      = DefaultIntHandler // 1:  Interrupt Pin (PH1/AINA1/95pin or 97pin)
#pragma weak INT2_IRQHandler      = DefaultIntHandler // 2:  Interrupt Pin (PH2/AINA2/94pin or 96pin)
#pragma weak INT3_IRQHandler      = DefaultIntHandler // 3:  Interrupt Pin (PA0/TB0IN/2pin or 4pin)
#pragma weak INT4_IRQHandler      = DefaultIntHandler // 4:  Interrupt Pin (PA2/TB1IN/4pin or 6pin)
#pragma weak INT5_IRQHandler      = DefaultIntHandler // 5:  Interrupt Pin (PE4/TB2IN//15pin or 17pin)
#pragma weak INTRX0_IRQHandler    = DefaultIntHandler // 6:  Serial reception (channel.0)
#pragma weak INTTX0_IRQHandler    = DefaultIntHandler // 7:  Serial transmit (channel.0)
#pragma weak INTRX1_IRQHandler    = DefaultIntHandler // 8:  Serial reception (channel.1)
#pragma weak INTTX1_IRQHandler    = DefaultIntHandler // 9:  Serial transmit (channel.1)
#pragma weak INTVCNA_IRQHandler   = DefaultIntHandler // 10: Vector Engine interrupt A
#pragma weak INTVCNB_IRQHandler   = DefaultIntHandler // 11: Vector Engine interrupt B
#pragma weak INTEMG0_IRQHandler   = DefaultIntHandler // 12: PMD0 EMG interrupt
#pragma weak INTEMG1_IRQHandler   = DefaultIntHandler // 13: PMD1 EMG interrupt
#pragma weak INTOVV0_IRQHandler   = DefaultIntHandler // 14: PMD0 OVV interrupt
#pragma weak INTOVV1_IRQHandler   = DefaultIntHandler // 15: PMD1 OVV interrupt
#pragma weak INTADAPDA_IRQHandler = DefaultIntHandler // 16: ADCA conversion triggered by PMD0 is finished
#pragma weak INTADBPDA_IRQHandler = DefaultIntHandler // 17: ADCB conversion triggered by PMD0 is finished
#pragma weak INTADAPDB_IRQHandler = DefaultIntHandler // 18: ADCA conversion triggered by PMD1 is finished
#pragma weak INTADBPDB_IRQHandler = DefaultIntHandler // 19: ADCB conversion triggered by PMD1 is finished
#pragma weak INTTB00_IRQHandler   = DefaultIntHandler // 20: 16bit TMRB0 compare match detection 0/ Over flow
#pragma weak INTTB01_IRQHandler   = DefaultIntHandler // 21: 16bit TMRB0 compare match detection 1
#pragma weak INTTB10_IRQHandler   = DefaultIntHandler // 22: 16bit TMRB1 compare match detection 0/ Over flow
#pragma weak INTTB11_IRQHandler   = DefaultIntHandler // 23: 16bit TMRB1 compare match detection 1
#pragma weak INTTB40_IRQHandler   = DefaultIntHandler // 24: 16bit TMRB4 compare match detection 0/ Over flow
#pragma weak INTTB41_IRQHandler   = DefaultIntHandler // 25: 16bit TMRB4 compare match detection 1
#pragma weak INTTB50_IRQHandler   = DefaultIntHandler // 26: 16bit TMRB5 compare match detection 0/ Over flow
#pragma weak INTTB51_IRQHandler   = DefaultIntHandler // 27: 16bit TMRB5 compare match detection 1
#pragma weak INTPMD0_IRQHandler   = DefaultIntHandler // 28: PMD0 PWM interrupt
#pragma weak INTPMD1_IRQHandler   = DefaultIntHandler // 29: PMD1 PWM interrupt
#pragma weak INTCAP00_IRQHandler  = DefaultIntHandler // 30: 16bit TMRB0 input capture 0
#pragma weak INTCAP01_IRQHandler  = DefaultIntHandler // 31: 16bit TMRB0 input capture 1
#pragma weak INTCAP10_IRQHandler  = DefaultIntHandler // 32: 16bit TMRB1 input capture 0
#pragma weak INTCAP11_IRQHandler  = DefaultIntHandler // 33: 16bit TMRB1 input capture 1
#pragma weak INTCAP40_IRQHandler  = DefaultIntHandler // 34: 16bit TMRB4 input capture 0
#pragma weak INTCAP41_IRQHandler  = DefaultIntHandler // 35: 16bit TMRB4 input capture 1
#pragma weak INTCAP50_IRQHandler  = DefaultIntHandler // 36: 16bit TMRB5 input capture 0
#pragma weak INTCAP51_IRQHandler  = DefaultIntHandler // 37: 16bit TMRB5 input capture 1
#pragma weak INT6_IRQHandler      = DefaultIntHandler // 38: Interrupt Pin (PE6/TB3IN//17pin or 19pin)
#pragma weak INT7_IRQHandler      = DefaultIntHandler // 39: Interrupt Pin (PE7/TB3OUT/18pin or 20pin)
#pragma weak INTRX2_IRQHandler    = DefaultIntHandler // 40: Serial reception (channel.2)
#pragma weak INTTX2_IRQHandler    = DefaultIntHandler // 41: Serial transmit (channel.2)
#pragma weak INTADACPA_IRQHandler = DefaultIntHandler // 42: ADCA conversion monitoring function interrupt A
#pragma weak INTADBCPA_IRQHandler = DefaultIntHandler // 43: ADCB conversion monitoring function interrupt A
#pragma weak INTADACPB_IRQHandler = DefaultIntHandler // 44: ADCA conversion monitoring function interrupt B
#pragma weak INTADBCPB_IRQHandler = DefaultIntHandler // 45: ADCB conversion monitoring function interrupt B
#pragma weak INTTB20_IRQHandler   = DefaultIntHandler // 46: 16bit TMRB2 compare match detection 0/ Over flow
#pragma weak INTTB21_IRQHandler   = DefaultIntHandler // 47: 16bit TMRB2 compare match detection 1
#pragma weak INTTB30_IRQHandler   = DefaultIntHandler // 48: 16bit TMRB3 compare match detection 0/ Over flow
#pragma weak INTTB31_IRQHandler   = DefaultIntHandler // 49: 16bit TMRB3 compare match detection 1
#pragma weak INTCAP20_IRQHandler  = DefaultIntHandler // 50: 16bit TMRB2 input capture 0
#pragma weak INTCAP21_IRQHandler  = DefaultIntHandler // 51: 16bit TMRB2 input capture 1
#pragma weak INTCAP30_IRQHandler  = DefaultIntHandler // 52: 16bit TMRB3 input capture 0
#pragma weak INTCAP31_IRQHandler  = DefaultIntHandler // 53: 16bit TMRB3 input capture 1
#pragma weak INTADASFT_IRQHandler = DefaultIntHandler // 54: ADCA conversion started by software is finished
#pragma weak INTADBSFT_IRQHandler = DefaultIntHandler // 55: ADCB conversion started by software is finished
#pragma weak INTADATMR_IRQHandler = DefaultIntHandler // 56: ADCA conversion triggered by timer is finished
#pragma weak INTADBTMR_IRQHandler = DefaultIntHandler // 57: ADCB conversion triggered by timer is finished
#pragma weak INT8_IRQHandler      = DefaultIntHandler // 58: Interrupt Pin (PA7/TB4IN/9pin or 11pin)
#pragma weak INT9_IRQHandler      = DefaultIntHandler // 59: Interrupt Pin (PD3/33pin or 35pin)
#pragma weak INTA_IRQHandler      = DefaultIntHandler // 60: Interrupt Pin (PL1/21pin or 23pin)
#pragma weak INTB_IRQHandler      = DefaultIntHandler // 61: Interrupt Pin (PL0/20pin or 22pin)
#pragma weak INTENC0_IRQHandler   = DefaultIntHandler // 62: Ender input0 interrupt
#pragma weak INTENC1_IRQHandler   = DefaultIntHandler // 63: Ender input1 interrupt
#pragma weak INTRX3_IRQHandler    = DefaultIntHandler // 64: Serial reception (channel.3)
#pragma weak INTTX3_IRQHandler    = DefaultIntHandler // 65: Serial transmit (channel.3)
#pragma weak INTTB60_IRQHandler   = DefaultIntHandler // 66: 16bit TMRB6 compare match detection 0 / Over flow
#pragma weak INTTB61_IRQHandler   = DefaultIntHandler // 67: 16bit TMRB6 compare match detection 1
#pragma weak INTTB70_IRQHandler   = DefaultIntHandler // 68: 16bit TMRB7 compare match detection 0 / Over flow
#pragma weak INTTB71_IRQHandler   = DefaultIntHandler // 69: 16bit TMRB7 compare match detection 1
#pragma weak INTCAP60_IRQHandler  = DefaultIntHandler // 70: 16bit TMRB6 input capture 0
#pragma weak INTCAP61_IRQHandler  = DefaultIntHandler // 71: 16bit TMRB6 input capture 1
#pragma weak INTCAP70_IRQHandler  = DefaultIntHandler // 72: 16bit TMRB7 input capture 0
#pragma weak INTCAP71_IRQHandler  = DefaultIntHandler // 73: 16bit TMRB7 input capture 1
#pragma weak INTC_IRQHandler      = DefaultIntHandler // 74: Interrupt Pin (PJ6/AINB9/74pin or 76 pin)
#pragma weak INTD_IRQHandler      = DefaultIntHandler // 75: Interrupt Pin (PJ7/AINB10/73pin or 75pin)
#pragma weak INTE_IRQHandler      = DefaultIntHandler // 76: Interrupt Pin (PK0/AINB11/72pin or 74pin)
#pragma weak INTF_IRQHandler      = DefaultIntHandler // 77: Interrupt Pin (PK1/AINB12/71pin or 73pin)
#pragma weak INTSBI0_IRQHandler   = DefaultIntHandler // 78: Serial bus interface 0

//*****************************************************************************
//
//! \brief This is the code that gets called when the processor receives an
//! unexpected interrupt.
//!
//! \param None.
//!
//! This simply enters an infinite loop, preserving the system state for
//! examination by a debugger.
//!
//! \return None.
//*****************************************************************************
static void DefaultIntHandler(void)
{
    //
    // Go into an infinite loop.
    //
    while (1)
    {
    }
}

